/************************************************************************
程序文本(简体中文)。
Copyright (C) 2021 NULL_703. All rights reserved.
Created on 2021.12.6  12:37
Created by NULL_703
Last change time on 2021.12.17  17:53
************************************************************************/
#ifndef SHARKCALCULATOR_TEXTS_H
#define SHARKCALCULATOR_TEXTS_H
    #define w0001 "SharkCalculator v0.0.0, Copyright (C) NULL_703. All rights reserved.\n"\
        "用法: shcalc {选项: [<没有选项>] [-<计算选项标识符>] [-n] [-h] [--bh] [--basic] [--storage]} {数字} ...\n"\
        "主要选项:\n"\
        "    [<没有选项>]: 使用内部命令。(在没有选项的情况下)\n"\
        "    [-<计算选项标识符>]: 直接计算一些公式或一些算式。\n"\
        "    [-n]: 使用常规计算。\033[0;32;31m <尚未开放>\033[m\n"\
        "    [-h]: 显示帮助。(打开外部的帮助文档)\033[0;32;31m <尚未开放>\033[m\n"\
        "    [--bh]: 显示简单的帮助。\n"\
        "    [--basic]: 简单计算模式。\n"\
        "    [--storage]: 打开存储模式。\n"\
        "程序内部命令: [n] [b] [l] [h] [s] [u] [e] [q] [c]\n"\
        "    n: 使用常规计算。\033[0;32;31m <尚未开放>\033[m\n"\
        "    b: 简单计算模式。\n"\
        "    l: 保存计算结果。\033[0;32;31m <尚未开放>\033[m\n"\
        "    h: 显示简单的帮助。\n"\
        "    s: 打开或关闭存储模式。\n"\
        "    u: 使用结果进行计算。\n"\
        "    e: 退出程序。\n"\
        "    q: 查找结果池中的数据。\n"\
        "    c: 清除结果池中的数据。\n"
    #define w0002 "请输入命令:\n-->"
    #define w0003 "\a错误：不能除以0！[E_1001]\n"
    #define w0004 "\a错误：无效参数！[E_2001]\n"
    #define w0005 "\a错误：公式不存在！[E_2002]\n"
    #define w0006 "\a错误：公式参数错误！[E_1002]\n"
    #define w0007 "\a错误：未知错误！[E_-1]\n"
    #define w0008 "\a错误：没有找到该命令！[E_2101]\n"
    #define w0009 "请输入表达式(格式: 数字-操作符-数字):\n-->"
    #define w0010 "简单计算。\n"
    #define w0011 "数字输入有误！ 请再试一遍。[E_2102]\n"
    #define w0012 "您是否要打开位于程序目录下的文档？ (y/n)\n"
    #define w0013 "\a错误：表达式错误！[E_1003]\n"
    #define w0014 "\a错误：这个模式尚未开放！[E_0001]\n"
    #define w0015 "计算结果为：\n\t->> "
    #define w0016 "\a错误：内部错误！[E_1101]\n"
    #define w0017 "请参见下面的帮助。\n"
    #define w0018 "你确定要清除所有数据？ (y/n)\n"
    #define w0019 "\a错误：存储模式尚未打开，无法清除或读取数据。[E_3001]\n"
    #define w0020 "\a错误：这个数据项不存在！[E_3002]\n"
    #define w0021 "警告：结果存储池已满，其中的数据已重置。[W_3001]\n"
    #define w0022 "最后编译时间： "
    #define w0023 "存储模式已打开。[I_3001]\n"
    #define w0024 "存储模式已关闭。[I_3002]\n"
    #define w0025 "存储模式未打开或结果太少。[W_3002]\n"
    #define w0026 "请输入表达式(格式: 计算结果编号-操作符-计算结果编号):\n-->"
    #define w0027 "请输入查找命令：\n-->"
    #define w0028 "请输入参数：\n-->"
    #define w0029 "这个结果是："
    #define w0030 "操作取消或选项错误。[I_3003]\n"
    #define w0031 "操作成功。\n"
#endif     //SHARKCALCULATOR_TEXTS_H